[
  {
    "category": "ablution",
    "graciousness": "لا صَلاةَ لِمَنْ لا وُضُوءَ لهُ, وَلا وُضُوءُ لِمَنْ لَمْ يَذْكُرِ اسْمَ الله عَليْهِ ",
    "hadith": "عن أبي هريرةَ  قالَ: قالَ رسولُ الله صلي الله عليه وسلم : (( لا صَلاةَ لِمَنْ لا وُضُوءَ لهُ, وَلا وُضُوءُ لِمَنْ لَمْ يَذْكُرِ اسْمَ الله عَليْهِ )) [صحيح أبي داود 101]",
    "note": " قال الشيخ  الألباني: وجوب التسمية هو ما يدل عليه ظاهره, ولا دليل يقتضي الخروج عن ظاهره إلى القول بأن الأمر للاستحباب فقط. فثبت الوجوب وهو مذهب الظاهرية, وإسحاق, وإحدى الروايتين عن أحمد, واختاره صديق خان, والشوكاني, وهو الحق إن شاء الله.أهـ [تمام المنة 89]",
    "numberOfRepetitions": 1,
    "priority": 1,
    "supplication": "بِسْمِ الله"
  },
  {
    "category": "ablution",
    "graciousness": "يفتح لك ابواب الجنة الثمانية اذا أسبغت الوضوء أن تقول",
    "hadith": "عن عمر مرفوعاً : (( مَا مِنْكُمْ مِنْ أَحَد يَتَوضَّأ فَيُسْبغُ الوُضُوءَ ثُمَّ يقُولُ: أَشْهَدُ أنَّهُ لا إلهَ إلا اللهُ وَحْدَهُ لا شَريكَ لَهُ, وأَشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ ورَسُولَهُ, إلاَّ فُتِحَتْ لَهُ أبْوابُ الجَنَّةِ الثَّمَانِيةُ يَدْخُلُ مِنْ أيِّها شَاءَ )) وزاد الترمذي:((اللَّهُمَّ اجْعَلْنِي مِنَ التَّوابينَ وَاجْعَلْني مِنَ المتُطهَّرينَ))[الإرواء 96]",
    "note": "وزاد الترمذي:((اللَّهُمَّ اجْعَلْنِي مِنَ التَّوابينَ وَاجْعَلْني مِنَ المتُطهَّرينَ))",
    "numberOfRepetitions": 1,
    "priority": 2,
    "supplication": "أَشْهَدُ أنَّهُ لا إلهَ إلا اللهُ وَحْدَهُ لا شَريكَ لَهُ, وأَشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ ورَسُولَهُ"
  },
  {
    "category": "ablution",
    "graciousness": "من توضأَ ثمَّ قالَها كُتِبَ في رقٍّ, ثم طُبِعَ بطابِعٍ, فلم يُكسر إلى يوم القيامة",
    "hadith": "عن أبي سعيد الخدري  قال: قال رسول الله صلي الله عليه وسلم : (( مِنَ توضأَ ثمَّ قالَ: سبحانَك اللهمَّ وبحمدك أشهد أن لا إله إلا أنتَ, أستغفرُكَ وأتوبُ إليكَ, كُتِبَ في رقٍّ, ثم طُبِعَ بطابِعٍ, فلم يُكسر إلى يوم القيامة)) [الصحيحة 2333ـ 2651]",
    "numberOfRepetitions": 1,
    "priority": 3,
    "supplication": "سبحانَك اللهمَّ وبحمدك أشهد أن لا إله إلا أنتَ, أستغفرُكَ وأتوبُ إليكَ"
  },
  {
    "category": "ablution",
    "graciousness": "غفران ما تقدم من الذنوب و توجب الجنة اذا أحسنت الوضوء و لم تسهو فيهما",
    "hadith": "عن عقبة بن عامر  قال رسول الله صلي الله عليه وسلم : (( مَا منْ أحدٍ يتوضَّأ فيحسنُ الوضوءَ, ويصلّي ركعتينِ يقبلُ بقلبهِ ووجهِهِ عليهما, إلا وجبتْ لهُ الجنَّة ))[ صحيح أبي داود 906]  وعن زيد بن خالد الجهني  أن رسول الله صلي الله عليه وسلم قال: (( مَنْ تَوضَّأ فأحسنَ وضوءهُ, ثمّ صلَّى ركعتينِ لا يسهُو فيهما, غُفرَ لهُ ما تقدمَ من ذنبه )) [صحيح أبي داود 907]  ",
    "numberOfRepetitions": 1,
    "priority": 4,
    "supplication": "أن تصلّي ركعتينِ"
  }
]
