[
  {
    "category": "prayers",
    "graciousness": "من السنة أن تبدأ فتقول",
    "hadith": "[قال ثوبان كان رسول الله إذا انصرفَ مِن صلاتِهِ استغفرَ الله ثَلاثاً, وقال:(( اللهمَّ أنتَ السَّلامُ, ومنكَ السلامُ, تبارَكتَ يا ذا الجلالِ والإكرامِ ))  [صحيح الكلم 88",
    "numberOfRepetitions": 1,
    "priority": 1,
    "supplication": "استغفرَ الله ثَلاثاً، ثم تقول : اللهمَّ أنتَ السَّلامُ, ومنكَ السلامُ, تبارَكتَ يا ذا الجلالِ والإكرامِ"
  },
  {
    "category": "prayers",
    "graciousness": "وصية النبى صلى الله عليه وعلى آله وسلم لمعاذ بعد أن أخبره أنه يحبه أن يلزم",
    "hadith": "وعن معاذ بن جبـل أن رسول الله أخذ بيده وقـال: يا معاذُ! إني والله لأحبُّك, فلا تدَعَنَّ في دُبُرِ كلِّ صلاةٍ أن تقولُ:(( اللهمَّ أعِنِّي على ذِكركَ وشُكرِكَ وحُسنِ عبادَتِك)) [صحيح أبي داود 1362]",
    "note": "تقال قبل التسليم أو بعده",
    "numberOfRepetitions": 1,
    "priority": 2,
    "supplication": "اللهمَّ أعِنِّي على ذِكركَ وشُكرِكَ وحُسنِ عبادَتِك"
  },
  {
    "category": "prayers",
    "graciousness": "ومن سنته صلى الله عليه وعلى آله وسلم ",
    "hadith": "وعن المغيرة بن شعبة أن رسول الله كان إذا فَرَغَ من الصلاة قال:(( لا إلهَ إلا الله وحدَهُ لا شريكَ له, لهُ الملكُ وله الحمدُ, وهـو على كلِّ شيءٍ قديرٌ, اللهمَّ لا مانِعَ لما أعطيتَ, ولا مُعطي لما   منعتَ, ولا ينفعُ ذا الجدِّ منكَ الجدُّ ))  [صحيح الكلم 89]",
    "numberOfRepetitions": 1,
    "priority": 3,
    "supplication": "لا إلهَ إلا الله وحدَهُ لا شريكَ له, لهُ الملكُ وله الحمدُ, وهـو على كلِّ شيءٍ قديرٌ, اللهمَّ لا مانِعَ لما أعطيتَ, ولا مُعطي لمامنعتَ, ولا ينفعُ ذا الجدِّ منكَ الجدُّ"
  },
  {
    "category": "prayers",
    "graciousness": "وكان يقول دُبُر كل صلاة",
    "hadith": "وعن عبد الله بن الزبير أنه كان يقولُ: دُبُرَ كلِّ صلاةٍ حين يُسلِّمُ: قبل أن يقوم يرفع بذلك صوته :(( لا إلهَ إلا الله وحدَهُ, لا شريكَ له, لهُ الملكُ, وله الحمدُ وهو على كلِّ شيءٍ قديرٌ, لا حولَ ولا قوَّة إلا بالله, لا إله إلا الله, ولا نعبدُ إلا إيَّاهُ له, النِّعمةُ ,ولهُ الفضلُ, وله الثناءُ الحسنُ, لا إلهَ إلا الله, مخلِصينَ له الدينَ ولو كرهَ الكافرون))",
    "numberOfRepetitions": 1,
    "priority": 4,
    "supplication": "لا إلهَ إلا الله وحدَهُ, لا شريكَ له, لهُ الملكُ, وله الحمدُ وهو على كلِّ شيءٍ قديرٌ, لا حولَ ولا قوَّة إلا بالله, لا إله إلا الله, ولا نعبدُ إلا إيَّاهُ له, النِّعمةُ ,ولهُ الفضلُ, وله الثناءُ الحسنُ, لا إلهَ إلا الله, مخلِصينَ له الدينَ ولو كرهَ الكافرون"
  },
  {
    "category": "prayers",
    "graciousness": "غفران الخطايا ما اجتنبت الكبائر ولو كانت مثل زبد البحر",
    "hadith": "عن أبي هريرة قال رسول الله :(( من سبح لله في دبر كل صلاة ثلاثاً وثلاثين, وحمد الله ثلاثاً وثلاثين, وكبر الله ثلاثاً وثلاثين, وقال تمام المائة لا إله إلا الله وحده لا شريك له, له الملك وله الحمد وهو على كل شيء قدير, غفرت خطاياه وإن كانت مثل زبد البحر ))  [الصحيحة 100ـ101]",
    "note": "وتنوع فى اﻵتى من صفات التسبيح فتأتى بهذه تارة وبهذه تارة وكذلك التنويع فى الصيغة فتارة تذكر سبحان الله بعددها ثم الحمد لله بعددها وهكذا وتارة تكررها جملة جملة تقول سبحان الله والحمد لله والله أكبر وتُعيدها بالعدد المشروع",
    "numberOfRepetitions": 33,
    "priority": 5,
    "supplication": "سبحان الله ثلاثاً وثلاثينَ الحمد لله ثلاثاً وثلاثينَ الله أكبر ثلاثاً وثلاثينَ وتمام المائة  لا إله إلا الله وحده لا شريك له, له الملك وله الحمد وهو على كل شيء قدي"
  },
  {
    "category": "prayers",
    "graciousness": "ولا يخيب من قال",
    "hadith": "عن كعب بن عجرة مرفوعاً :(( مُعَقِّباتٌ لا يخيبُ قائِلُهُنَّ أو فاعِلُهُنَّ دُبُرَ كُلِّ صلاةٍ مكتوبة: ثلاثٌ وثلاثونَ تَسبيحَة,ً وثلاثٌ وثلاثونَ تحميدةً, وأربعٌ وثلاثونَ تكبيرةً ))  [الصحيحة 102] ",
    "note": "وتنوع فى اﻵتى من صفات التسبيح فتأتى بهذه تارة وبهذه تارة وكذلك التنويع فى الصيغة فتارة تذكر سبحان الله بعددها ثم الحمد لله بعددها وهكذا وتارة تكررها جملة جملة تقول سبحان الله والحمد لله والله أكبر وتُعيدها بالعدد المشروع",
    "numberOfRepetitions": 33,
    "priority": 6,
    "supplication": "سبحان الله ثلاثاً وثلاثينَ الحمد لله ثلاثاً وثلاثينَ الله أكبر أربعاً وثلاثينَ"
  },
  {
    "category": "prayers",
    "graciousness": "ومن السنة كذلك ",
    "hadith": "عن ابن عمر أن رجلاً رأى فيما يرى النائمُ, قِيلَ لهُ: بأي شيءٍ أمركُمْ نبيكُمْ؟ قال: أمرنَا أنْ نُسبحَ ثلاثاً وثلاثينَ, ونحمدَ ثَلاثاً وثلاثينَ, ونُكبِّرَ أرْبعاً ثلاثينَ, فتلك مائةٌ, قال: سَبِّحُوا   خمساً وعشرينَ, واحمدُوا خمساً وعشرينَ, وكبرُوا خمساً وعشرينَ, و(هلّلُوا) خمساً وعشرينَ, فتلكَ مائةٌ, فلمَّا أصبحَ ذكرَ ذلكَ للنّبي فقال رسول الله:(( فعَلُوا كمَا قالَ الأنصاريُّ)) ",
    "note": "وتنوع فى اﻵتى من صفات التسبيح فتأتى بهذه تارة وبهذه تارة وكذلك التنويع فى الصيغة فتارة تذكر سبحان الله بعددها ثم الحمد لله بعددها وهكذا وتارة تكررها جملة جملة تقول سبحان الله والحمد لله والله أكبر وتُعيدها بالعدد المشروع",
    "numberOfRepetitions": 25,
    "priority": 7,
    "supplication": "سبحان الله خمساً وعشرينَ الحمد لله خمساً وعشرينَ الله أكبر خمساً وعشرينَ لا إله إلا الله خمساً وعشرينَ"
  },
  {
    "category": "prayers",
    "graciousness": "وما يحافظ عبد على اﻵتى دُبُر كل صلاة إلا  دخل الجنة، وهى خمسون ومائة باللّسان وألف وخمسمائةٍ فى الميزان",
    "hadith": "عن  عبد الله بن عمرو عن النبي قال: (( خَصْلَتانِ, أو خلَّتانِ, لا يحافظُ عليهما عبدُ مسلمٌ لا دخلَ الجنّةَ, وهما يسيرٌ, ومَن يعملُ بهما قليـلٌ: يُسبحُ الله في دُبُرِ كل صـلاةٍ عشراً, ويحمدُه  عشراً, ويكبرهُ عشراً, وذلك خمسونَ ومائةٌ باللسان, وألفٌ وخمسمائةٍ في الميزانِ ...الحديث)) [صحيح الكلم 93]",
    "note": "وتنوع فى اﻵتى من صفات التسبيح فتأتى بهذه تارة وبهذه تارة وكذلك التنويع فى الصيغة فتارة تذكر سبحان الله بعددها ثم الحمد لله بعددها وهكذا وتارة تكررها جملة جملة تقول سبحان الله والحمد لله والله أكبر وتُعيدها بالعدد المشروع",
    "numberOfRepetitions": 10,
    "priority": 8,
    "supplication": "سبحان الله عشرًا الحمد لله عشراً الله أكبر عشراً"
  },
  {
    "category": "prayers",
    "graciousness": "تقرأها دُبُر كل صلاة ما يحول بينك وبين الجنة إلا أن تموت",
    "hadith": "عن أبي أمامة الباهلي قال: قال رسول الله:(( مَنْ قرأ آيةَ الكرسيِّ في دُبُر كلّ صلاة, لم يحلْ بينه وبينَ دخول الجنّةِ إلا أن يموتُ )) [الصحيحة 972]",
    "numberOfRepetitions": 1,
    "priority": 9,
    "supplication": "(اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ) "
  },
  {
    "category": "prayers",
    "graciousness": "وأمر النبى صلى الله عليه وعلى آله وسلم عقبة بن عامر أن يقرأ دُبُر كل صلاة المعوذات",
    "hadith": "وعن عقبة بن عامر قال: (( أمرني رسول الله أن أقرأ المعوِّذات (وهي قُلْ هو الله أحد  و قُلْ أعوذُ بِربّ الفلق  و  قُلْ أعوذُ بِربّ النّاس  دُبُر كلّ صلاة ))  [الصحيحة645/ 1514]  ",
    "numberOfRepetitions": 1,
    "priority": 10,
    "supplication": "أعوذ بالله من الشيطان الرجيم.. بسم الله الرحمن الرحيم سورة الإخلاص.. (قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4))  سورة الفلق.. (قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5))  سورة الناس.. (قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6))"
  },
  {
    "category": "prayers",
    "graciousness": "ومن السنة كذلك ",
    "hadith": "عن رجلٍ من الأنصار قال سمعت رسول الله يقول في دبر الصلاة:(( اللهمَّ اغفِرْ لي, وتُبْ عليَّ إنّكَ أنتَ التوّابُ الغفور [مائة مرة] ))  [الصحيحة 2603]",
    "numberOfRepetitions": 100,
    "priority": 11,
    "supplication": "تقول :  اللهمَّ اغفِرْ لي, وتُبْ عليَّ إنّكَ أنتَ التوّابُ الغفور"
  },
  {
    "category": "prayers",
    "graciousness": "كان يقول صلى الله عليه وعلى آله وسلم",
    "hadith": "وعن أم سلمة أن النبي كان يقول بعد الفجر: (( اللهمَّ إني أسألكَ علماً نافعاً, وعملاً متقبلاً ورزقاً طيباً))  [هداية الرواة 2432]",
    "note": "أذكار خاصة دُبُر صلاة الصبح",
    "numberOfRepetitions": 1,
    "priority": 12,
    "supplication": "اللهمَّ إني أسألكَ علماً نافعاً, وعملاً متقبلاً ورزقاً طيباً"
  },
  {
    "category": "prayers",
    "graciousness": "غفران الذنوب ما اجتنبت الكبائر ولو كانت مثل زبد البحر",
    "hadith": "عن أبي هريرة قال: قال رسول الله: (( مَنْ سبَّحَ في دُبُرِ صلاةِ الغَداةِ مائةَ تسبيحةٍ, وهللَ مائةَ تهليلةٍ, غُفرتْ لهُ ذنوبُهُ, ولو كانتْ مثل زبدِ البحرِ ))  [صحيح النسائي 1353]",
    "note": "أذكار خاصة دُبُر صلاة الصبح",
    "numberOfRepetitions": 100,
    "priority": 13,
    "supplication": "سبحان الله مائة لا إله إلا الله مائة"
  },
  {
    "category": "prayers",
    "graciousness": "لك من الله بكل واحدة عشرَ حسناتٍ, ومحو عنه عشرَ سيئاتٍ, وَرفعُ عشرَ درجاتٍ, وكانت حِرزاً من مكروه, وحِرزاً من الشيطان الرجيم, ولم يحلَّ لذنبٍ أن يُدركه إلا الشركُ, وكان من أفضل الناس عَمـَلاً يَفضلُهُ, يقول أفضلَ مما قال",
    "hadith": "عن عبد الرحمن بن غَنْمٍ عن النبي أنه قال:(( من قال قَبل أنْ ينصرفَ ويَثنيَ رِجلَيه من صلاةِ المغربِ والصبحِ: لا إلهَ إلا الله وحدَه لا شريكَ له, له الملكُ, وله الحمدُ, يحيي ويميت, وهو على كل شيءٍ قدير عشرَ مرات كتب الله له بكل واحدة عشرَ حسناتٍ, ومحا عنه عشرَ سيئاتٍ, ورفَعَ له عشرَ درجاتٍ, وكانت حِرزاً من مكروه, وحِرزاً من الشيطان الرجيم, ولم يحلَّ لذنبٍ أن يُدركه إلا الشركُ, وكان من أفضل الناس عَمـَلاً   يَفضلُهُ, يقول أفضلَ مما قال ))  [صحيح الترغيب 477]",
    "note": " أذكار خاصة دُبُر صلاتى الصبح والمغرب. تقولها قبل أن تُغَيِّر جلستك للتشهد ",
    "numberOfRepetitions": 10,
    "priority": 14,
    "supplication": " لا إلهَ إلا الله وحدَه لا شريكَ له, له الملكُ, وله الحمدُ, يحيي ويميت, وهو على كل شيءٍ قدير  عشرَ مرات وتزيد ما استطعت"
  },
  {
    "category": "prayers",
    "graciousness": "لك من الله بكل واحدة عشرَ حسناتٍ, ومحو عنه عشرَ سيئاتٍ, وَرفعُ عشرَ درجاتٍ, وكانت حِرزاً من مكروه, وحِرزاً من الشيطان الرجيم, ولم يحلَّ لذنبٍ أن يُدركه إلا الشركُ, وكان من أفضل الناس عَمـَلاً يَفضلُهُ, يقول أفضلَ مما قال",
    "hadith": "عن أبي أمامة مرفوعاً:(( من قال في دُبُرَ صلاة الغَداةِ: (( لا إله إلا الله وحدَه لا شريكَ له, له الملكُ, وله الحمدُ, يحيي ويميت, بيده الخير, وهو على كل شيءٍ قدير ))  مائة مرةٍ وهو ثانٍ رِجليه كان يومئذٍ أفضل أهل الأرض عملاً إلا من قال مثل ما قال أو زاد على ما قال ))  [الصحيحة2664/تراجع العلامة  98]",
    "note": " أذكار خاصة دُبُر صلاتى الصبح والمغرب. تقولها قبل أن تُغَيِّر جلستك للتشهد و تارة تقولها مائة مرة",
    "numberOfRepetitions": 100,
    "priority": 15,
    "supplication": "لا إله إلا الله وحدَه لا شريكَ له, له الملكُ, وله الحمدُ, يحيي ويميت, بيده الخير, وهو على كل شيءٍ قدير"
  }
]
